# GetMaterialVolume

## Description
Returns the volume of the object having the specified material.

```pascal
FUNCTION GetMaterialVolume(
				h        : HANDLE;
				material : STRING) : REAL;
```

```python

def vs.GetMaterialVolume(h, material):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to the object.|
|material|STRING|Returns the volume of the object having the specified material.|

## Returns
Returns the volume of the object having the specified material.

## Version
Availability: from Vectorworks 2021
## Category
* Object Attributes